stroki = str(input("Введите строку: ")) #Запрос строки от пользователя
print("Длина строки:",len(stroki)) #Вывод длины строки
glasn = 0 #Счетчик гласных
soglasn = 0 #Счетчик согласных
for i in stroki: #Цикл для проверки условия
    if i == "А" or i == "У" or i == "О"or i == "И"or i == "Э"or i == "Ы"or i == "Я"or i == "Ю" or i == "Е" or i == "Ё" or i == "а" or i == "у" or i == "о"or i == "и"or i == "э"or i == "ы"or i == "я"or i == "ю" or i == "е" or i == "ё": #Проверка условия
        glasn+=1 #Увеличение счетчика
    else: #Работает если условие не верно
        soglasn+=1 #Увеличение счетчика
print("Количество гласных: ",glasn) #Вывод данных
print("Количество согласных: ",soglasn) #Вывод данных